000100      ************************************************************00010004
000200      * DATA     :  05/01/2024                                    00020004
000300      * AUTOR    : VAGNER RENATO BELLACOSA                        00030004
000400      * OBJETIVO : ESTRUTURA DO COBOL AS 4 DIVISOES               00040004
000500      * CPD      : INEFE                                          00050004
000600      ************************************************************00060004
000700       IDENTIFICATION DIVISION.                                   00070004
000701      *                                                           00070106
000710       PROGRAM-ID. COBOL001.                                      00071007
000800      *                                                           00080004
001400       ENVIRONMENT DIVISION.                                      00140004
001500      *                                                           00150004
002400       DATA DIVISION.                                             00240004
002500      *                                                           00250004
004000       PROCEDURE DIVISION.                                        00400004
004100      *                                                           00410004
015000      ********************* FIM DO PROGRAMA **********************01500004
