      *****************************************************************
      * DATA     :  24/05/2023
      * AUTOR    : VAGNER RENATO BELLACOSA
      * OBJETIVO : IDENTIFICATION DIVISION E COMANDOS
      * CPD      : INEFE
      *****************************************************************
       IDENTIFICATION DIVISION.
      *
       PROGRAM-ID. COBOL002.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.
      *
       PROCEDURE DIVISION.
      *
           DISPLAY 'HELLO WORLD!'.
           STOP RUN.
      ********************* FIM DO PROGRAMA ****************************
