      *****************************************************************
      * DATA     : 17/09/2024
      * AUTOR    : VAGNER RENATO BELLACOSA
      * OBJETIVO : PROGRAMA TESTE DE MENSAGEMS DE ERRO
      * CPD      : INEFE
      *****************************************************************
       IDENTIFICATION DIVISION

       PROGRAM-ID.ERRMSG.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.

           STOP RUN.
