      *****************************************************************
      * DATA     : 24/05/2023
      * AUTOR    : VAGNER RENATO BELLACOSA
      * OBJETIVO : DATA DIVISION E COMANDOS
      * CPD      : INEFE
      *****************************************************************
       IDENTIFICATION DIVISION.
      *************************
       PROGRAM-ID. COBOL004.
       AUTHOR. VAGNER BELLACOSA.
       DATE-WRITTEN. 23/05/24 @ 14:30:54.
       DATE-COMPILED. 2023-05-24.
      *
      **********************
       ENVIRONMENT DIVISION.
      **********************
      *
      ***************
       DATA DIVISION.
      ***************
      *
       FILE SECTION.
      *
       WORKING-STORAGE SECTION.
      *
       LOCAL-STORAGE SECTION.
      *
       LINKAGE SECTION.
      *
      ********************
       PROCEDURE DIVISION.
      ********************

           DISPLAY 'HELLO WORLD'.

      *    MOVE    13     TO  RETURN-CODE.

           STOP RUN.

       END PROGRAM COBOL004.
      ********************* FIM DO PROGRAMA ****************************
