000100*****************************************************************
000200* DATA     :  30/05/2023
000300* AUTOR    : VAGNER RENATO BELLACOSA
000400* OBJETIVO : PROGRAMA EXEMPLO VARIAVEL NIVEL 88
000500*            VARIAVEL CONDICIONAL / LOGICA
000600*            USO DE SET
000700*            CONCEITOS DE VERDADEIRO E FALSO
000800* CPD      : INEFE
000900*****************************************************************
001000 IDENTIFICATION DIVISION.
001100*************************
001200 PROGRAM-ID. COBOL018.
001300 AUTHOR. VAGNER BELLACOSA.
001400 DATE-WRITTEN. 30/05/23 @ 10:50:00.
001500 DATE-COMPILED. 2023-05-30.
001600
001700**********************
001800 ENVIRONMENT DIVISION.
001900**********************
002000
002100***************
002200 DATA DIVISION.
002300***************
002400 FILE SECTION.
002500*
002600 WORKING-STORAGE SECTION.
002700*
002800 01  WSS-SEXO                  PIC X(01).
002900   88 LOG-MASCULINO  VALUE 'M'.
003000   88 LOG-FEMININO   VALUE 'F'.
003010   88 LOG-INDEFINIDO VALUE ' '.
003020   88 LOG-NAO-RESP   VALUE 'N'.
003100*
003200********************
003300 PROCEDURE DIVISION.
003400********************
003500
003600
003700     DISPLAY 'COBOL018'.
003800     DISPLAY 'VARIAVEL HIERARQUIVA NIVEL 01'.
003900
004000     DISPLAY '001 '.
004100     DISPLAY 'WSS-SEXO         : ' WSS-SEXO.
004200     DISPLAY ' '
004300
004400     MOVE 'X'               TO WSS-SEXO.
004500
004600     DISPLAY '002 '.
004700     DISPLAY 'WSS-SEXO         : ' WSS-SEXO.
004800     DISPLAY ' '
004900
005000     MOVE 'M'                      TO WSS-SEXO.
005100
005200     IF LOG-MASCULINO
005300       DISPLAY '003-A'
005400       DISPLAY 'WSS-SEXO         : ' WSS-SEXO
005500     ELSE
005600       DISPLAY 'ERRO'
005700       DISPLAY ' '
005800     END-IF.
005900
006000     SET LOG-FEMININO        TO TRUE.
006100
006110     DISPLAY ' '.
006120
006200     IF LOG-MASCULINO
006300       DISPLAY 'ERRO'
006400     ELSE
006500       DISPLAY '003-B'
006600       DISPLAY 'WSS-SEXO         : ' WSS-SEXO
006700       DISPLAY ' '
006800     END-IF.
006900
007000     IF LOG-MASCULINO
007001       DISPLAY '003-C'
007002       DISPLAY 'WSS-SEXO         : ' WSS-SEXO
007003       DISPLAY ' '
007020     ELSE
007030       DISPLAY 'ERRO'
007060     END-IF.
007061
007062     IF WSS-SEXO  = 'F'
007063       DISPLAY '003-D'
007064       DISPLAY 'WSS-SEXO         : ' WSS-SEXO
007065       DISPLAY ' '
007066     ELSE
007067       DISPLAY 'ERRO'
007068     END-IF.
007070
007071     DISPLAY ' '.
007072
007073     SET LOG-INDEFINIDO  TO TRUE
007074
007080     IF LOG-MASCULINO
007081        DISPLAY ' MASCULINO '
007090     ELSE
007091       IF LOG-FEMININO
007092         DISPLAY ' FEMININO '
007093       ELSE
007094         IF LOG-INDEFINIDO
007095           DISPLAY ' INDEFINIDO '
007096         ELSE
007097           DISPLAY ' ERRO '
007098         END-IF
007099       END-IF
007100     END-IF.
007101
007102     MOVE 'T' TO WSS-SEXO
007103
007104     DISPLAY ' '.
007105
007106     EVALUATE TRUE
007107       WHEN LOG-MASCULINO
007108         DISPLAY ' MASCULINO '
007109       WHEN LOG-FEMININO
007110         DISPLAY ' FEMININO '
007111       WHEN LOG-INDEFINIDO
007112         DISPLAY ' INDEFINIDO '
007113       WHEN LOG-NAO-RESP
007114         DISPLAY ' NAO RESPONDEU '
007115       WHEN OTHER
007116         DISPLAY ' WSS-SEXO = ' WSS-SEXO
007117     END-EVALUATE.
007118
007120     STOP RUN.
007200
007210 END PROGRAM COBOL018.
007300********************** FIM PROGRAMA   ****************************
